<template>
  <main class="main">
    <div class="main-inner">
      <div class="sidebar">
        由于SPA页面的特性，传统的设置 body 背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
      </div>
      <div class="articleList">
        由于SPA页面的特性，传统的设置 body 背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。
        解决方案：利用组件内的路由实现由于SPA页面的特性，传统的设置 body
        背景色的方法并不通用。 解决方案：利用组件内的路由实现
      </div>
    </div>
  </main>
</template>
 
<script>
export default {
  name: "",
  beforeCreate() {
    document.body.style.background = "#eee";
  },
  beforeDestroy() {
    document.body.style.background = "";
  },
};
</script>

<style scoped>
.main {
  display: flex;
  justify-content: center;
  background-color: red;
}

.main-inner {
  display: flex;
  width: 1200px;
  height: 2000px;
  background-color: pink;
}

.sidebar {
  width: 240px;
  height: 300px;
  margin: 200px 10px 0;
  background-color: lightskyblue;
}

.articleList {
  width: calc(100% - 260px);
  height: 40rem;
  background-color: lightyellow;
}

@media (min-width: 1600px) {
  .main-inner {
    width: 73%;
  }
}

@media (max-width: 990px) {
  .sidebar {
    display: none;
  }
}

@media (max-width: 990px) {
  .main-inner {
    width: auto;
  }
}

@media (max-width: 990px) {
  .articleList {
    width: 100%;
  }
}
</style>